# GroupTypeId Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId Class
Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static class GroupTypeId
```

Visual Basic
---
```text
Public NotInheritable Class GroupTypeId
```

Visual C++
---
```text
public ref class GroupTypeId abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GroupTypeId
# See Also
GroupTypeId Members
Autodesk.Revit.DB Namespace